DataProcessors/РСК_ПолучателиТСР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>РСК_ПолучателиТСР</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РСК_СтатусыАктовВыдачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>РСК_СтатусыАктовВыдачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяЗамена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОтчете</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РСК_СтатусыПолучателяТСР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>РСК_СтатусыПолучателяТСР</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Умер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выбыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНайден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СпособыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчикаПоАдресу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КПолучателюОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоручениеЭкспедиторуНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоручениеЭкспедиторуСоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоручениеЭкспедиторуВПункте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчикаДоПунктаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПоставщикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НашимиСиламиСАдресаОтправителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтОтправителяОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РСК_ПеревозчикДоПВЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РСК_ПеревозчикДоКлиента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоручениеЭкспедитору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоручениеЭкспедитору</Name>
			<RegisterRecords>
				<xr:Item>InformationRegister.РСК_СтатусыВыполненияКонтрактов</xr:Item>
				<xr:Item>InformationRegister.РСК_АктВыдачиТСР</xr:Item>
				<xr:Item>AccumulationRegister.РСК_СостояниеЗаказовКлиентовПоВыдаче</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяИнформацияПоДоставке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пункт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательДоставки</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсобыеУсловияПеревозкиОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_АктВыдачиТСР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_СтатусАктаВыдачиТСР</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РСК_СтатусыАктовВыдачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_НомерРеестра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_ДатаРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_ТСР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_НомерНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_ДатаНаправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_НомерЗаявки</Name>
					<Comment>РС Консалт: Трофимов Евгений 12.11.2022 Задача 21867</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/РСК_ПолучателиТСР/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокПартнёров.ТекстЗапроса = ТекстЗапросаПартнёров();
	СписокПартнёров.Параметры.УстановитьЗначениеПараметра(
		"ВидАдресаРегистрации", 
		РСК_ПовтИсп.Получить_Справочники_ВидыКонтактнойИнформации_ПоИдентификатору("АдресРегистрации")
	);
	СписокДокументов.ТекстЗапроса = СтрЗаменить(
		СписокДокументов.ТекстЗапроса,
		"ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)",
		"&Заявитель"
	);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра(
		"Заявитель",
		Справочники.Партнеры.ПустаяСсылка()
	);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаПартнёров()

	Текст = 
		"ВЫБРАТЬ
		|	Партнеры.Ссылка КАК Ссылка,
		|	Партнеры.Наименование КАК Наименование,
		|	Партнеры.РСК_СНИЛС КАК СНИЛС,
		|	ПОДСТРОКА(ЕСТЬNULL(КонтактыАдресРег.Представление, """"), 1, 150) КАК АдресРегистрации,
		|	ПОДСТРОКА(ЕСТЬNULL(КонтактыАдресПроживания.Представление, """"), 1, 150) КАК АдресМестожительства,
		|	ПОДСТРОКА(ЕСТЬNULL(КонтактыТелефон.Представление, """"), 1, 150) КАК Телефон,
		|	Партнеры.РСК_СтатусПолучателяТСР КАК Статус,
		|	Партнеры.РСК_ПаллиативнаяПомощь КАК ПаллиативнаяПомощь,
		|	Партнеры.ДатаРождения КАК ДатаРождения,
		|	Партнеры.ЗонаДоставки КАК ЗонаДоставки,
		|	ЕСТЬNULL(ЗоныДоставки.Родитель, ЗНАЧЕНИЕ(Справочник.ЗоныДоставки.ПустаяСсылка)) КАК Регион
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК КонтактыАдресРег
		|		ПО Партнеры.Ссылка = КонтактыАдресРег.Ссылка
		|			И (КонтактыАдресРег.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|			И (КонтактыАдресРег.Вид = &ВидАдресаРегистрации)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК КонтактыАдресПроживания
		|		ПО Партнеры.Ссылка = КонтактыАдресПроживания.Ссылка
		|			И (КонтактыАдресПроживания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|			И (КонтактыАдресПроживания.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПартнера))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК КонтактыТелефон
		|		ПО Партнеры.Ссылка = КонтактыТелефон.Ссылка
		|			И (КонтактыТелефон.ВидДляСписка = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПартнера))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗоныДоставки КАК ЗоныДоставки
		|		ПО Партнеры.ЗонаДоставки = ЗоныДоставки.Ссылка
		|ГДЕ
		|	Партнеры.РСК_ЭтоПолучательТСР";
	
	Возврат Текст;

КонецФункции // ТекстЗапросаПартнёров()

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьСписокДокументов",0.5,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокДокументов() Экспорт

	ТД = Элементы.Список.ТекущиеДанные;
	Если ТД = Неопределено ИЛИ НЕ ТД.Свойство("Ссылка") Тогда
		Возврат;
	КонецЕсли;
	
	СписокДокументов.Параметры.УстановитьЗначениеПараметра(
		"Заявитель",
		ТД.Ссылка
	);
	
	Элементы.Список.Обновить();

КонецПроцедуры // ОбновитьСписокДокументов()

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДанныеСтроки = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
	ИмяПоля = Сред(Поле.Имя, СтрДлина(Элемент.Имя)+1);
	ПоказатьЗначение(, ДанныеСтроки[ИмяПоля]);	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьАкт(Команда)
	ТекДанные = Элементы.СписокДокументов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Выберите документ!");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СкладВыдачи) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Укажите склад выдачи!",,
			"СкладВыдачи"
		);
		Возврат;
	КонецЕсли;
	
	ЗагрузочнаяВедомость = ТекДанные.ЗагрузочнаяВедомость;
	СтатусАкта = ТекДанные.Статус;

	Если ЗагрузочнаяВедомость = ПредопределенноеЗначение("Документ.ЗаданиеНаПеревозку.ПустаяСсылка") Тогда
		Док = ТекДанные.Акт;
		Текст = "";
		ПометитьНаСервере(Док,Текст,"Закрыть");
		
	ИначеЕсли  ЗагрузочнаяВедомость <> ПредопределенноеЗначение("Документ.ЗаданиеНаПеревозку.ПустаяСсылка") 
		И (СтатусАкта = ПредопределенноеЗначение("Перечисление.РСК_СтатусыАктовВыдачи.Отгружен")
		ИЛИ СтатусАкта = ПредопределенноеЗначение("Перечисление.РСК_СтатусыАктовВыдачи.Доставлен")) Тогда
		ПоказатьПредупреждение(, "Документ отгружен в загрузочной ведомости! "+ЗагрузочнаяВедомость+" Закрытие невозможно!");
		
	ИначеЕсли ЗагрузочнаяВедомость <> ПредопределенноеЗначение("Документ.ЗаданиеНаПеревозку.ПустаяСсылка")
		И (СтатусАкта = ПредопределенноеЗначение("Перечисление.РСК_СтатусыАктовВыдачи.Создан")
		ИЛИ СтатусАкта = ПредопределенноеЗначение("Перечисление.РСК_СтатусыАктовВыдачи.Подготовлен")) Тогда
		ПоказатьПредупреждение(, "Акт выбран в  "+ ЗагрузочнаяВедомость +". Не забудьте удалить акт из этой загрузочной ведомости!");
		Док = ТекДанные.СсылкаСсылка;
		ПометитьНаСервере(Док,Текст,"Закрыть");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПометитьНаСервере(Док,Текст,Команда)
	Об = Док.ПолучитьОбъект();
	Если Команда = "Удалить" Тогда
		Об.ПометкаУдаления = Истина;
		Об.Комментарий = Текст;
		Об.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	ИначеЕсли Команда = "Закрыть" Тогда
		Об.РСК_СтатусАктаВыдачиТСР = Перечисления.РСК_СтатусыАктовВыдачи.Выдан;
		Об.Комментарий = Текст;
		Об.ДатаЗакрытия = ТекущаяДата();
		Если ЗначениеЗаполнено(Об.СкладВыдачи) Тогда
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В Документе Акт %1  уже установлен Склад выдачи %2'"),
				Об.Ссылка, Об.СкладВыдачи);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, Об.Ссылка, , , );
			Возврат;
		Иначе
			Об.Склад = СкладВыдачи;
		КонецЕсли;
		Об.Записать(РежимЗаписиДокумента.Проведение);
	ИначеЕсли Команда = "ОтменитьЗакрытие" Тогда
		Об.РСК_СтатусАктаВыдачиТСР = Перечисления.РСК_СтатусыАктовВыдачи.Подготовлен;
		Об.Комментарий = Текст;
		Об.Записать(РежимЗаписиДокумента.Проведение);
	ИначеЕсли Команда = "Аннулировать"	 Тогда
		Об.РСК_СтатусАктаВыдачиТСР = Перечисления.РСК_СтатусыАктовВыдачи.Аннулирован;
		Об.Комментарий = Текст;
		Об.Записать(РежимЗаписиДокумента.Проведение);
	ИначеЕсли Команда = "ОтменитьАннулирование"	 Тогда
		Об.РСК_СтатусАктаВыдачиТСР = Перечисления.РСК_СтатусыАктовВыдачи.Подготовлен;
		Об.Комментарий = Текст;
		Об.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ВызватьИсключение "Команда "+Команда+" не определена. Обратитесь к программисту 1С!";
	КонецЕсли;
	Элементы.СписокДокументов.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗакрытиеАкта(Команда)
	ТекДанные = Элементы.СписокДокументов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Выберите документ!");
		Возврат;
	КонецЕсли;
	
	Док = ТекДанные.Акт;
	Текст = "";
	Подсказка = "Укажите причину!";
	ПоказатьВводСтроки(
		Новый ОписаниеОповещения(
			"ОтменитьЗакрытиеЗавершение", 
			ЭтотОбъект, 
			Новый Структура("Док", Док)
		), 
		Текст, 
		Подсказка, 
		0, 
		Истина
	);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗакрытиеЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	Если Строка = Неопределено ИЛИ ПустаяСтрока(Строка) Тогда
		ПоказатьПредупреждение(, "Необходимо ввести причину!!!");
		Возврат;
	КонецЕсли;
	
	ПометитьНаСервере(ДополнительныеПараметры.Док, Строка, "ОтменитьЗакрытие");

КонецПроцедуры

&НаКлиенте
Процедура АннулироватьАкт(Команда)
	ТекДанные = Элементы.СписокДокументов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Выберите документ!");
		Возврат;
	КонецЕсли;
	Док = ТекДанные.Акт;
	Текст = "";
	Подсказка = "Укажите причину!";
	ПоказатьВводСтроки(
		Новый ОписаниеОповещения(
			"АннулироватьАктЗавершение", 
			ЭтотОбъект, 
			Новый Структура("Док", Док)
		), 
		Текст, 
		Подсказка, 
		0, 
		Истина
	);
КонецПроцедуры

&НаКлиенте
Процедура АннулироватьАктЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	Если Строка = Неопределено ИЛИ ПустаяСтрока(Строка) Тогда
		ПоказатьПредупреждение(, "Необходимо ввести причину!!!");
		Возврат;
	КонецЕсли;
	
	ПометитьНаСервере(ДополнительныеПараметры.Док, Строка, "Аннулировать");

КонецПроцедуры

&НаКлиенте
Процедура ОтменитАннулированиеАкта(Команда)
	ТекДанные = Элементы.СписокДокументов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Выберите документ!");
		Возврат;
	КонецЕсли;
	Текст = "";
	Подсказка = "Укажите причину!";
	ПоказатьВводСтроки(
		Новый ОписаниеОповещения(
			"ОтменитьАннулированиеЗавершение", 
			ЭтотОбъект, 
			Новый Структура("Док", ТекДанные.Акт)
		), 
		Текст, 
		Подсказка, 
		0, 
		Истина
	);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьАннулированиеЗавершение(Строка, ДополнительныеПараметры) Экспорт
	Если Строка = Неопределено ИЛИ ПустаяСтрока(Строка) Тогда
		ПоказатьПредупреждение(, "Необходимо ввести причину!!!");
		Возврат;
	КонецЕсли;
	
	ПометитьНаСервере(ДополнительныеПараметры.Док, Строка, "ОтменитьАннулирование");

КонецПроцедуры

&НаКлиенте
Процедура СоздатьАкт(Команда)
	ТД = Элементы.СписокДокументов.ТекущиеДанные;
	ПараметрыДок = Новый Структура;
	Если ТД = Неопределено Тогда
		ТД = Элементы.Список.ТекущиеДанные;
		Если ТД = Неопределено ИЛИ НЕ ТД.Свойство("Ссылка") Тогда
			ПоказатьПредупреждение(,"Выберите получателя ТСР");
			Возврат;
		КонецЕсли;
		ПараметрыДок.Вставить("Пункт", ТД.Ссылка);
	Иначе
		ПараметрыДок.Вставить("Пункт", ТД.Заявитель);
		ТД = Элементы.Список.ТекущиеДанные;
	КонецЕсли;
	ПараметрыДок.Вставить("ЗонаДоставки", ТД.ЗонаДоставки);
	Если ТД.Статус = ПредопределенноеЗначение("Перечисление.РСК_СтатусыПолучателяТСР.Умер") Тогда
		ПоказатьПредупреждение(,"Получатель ТСР умер");
		Возврат;
	КонецЕсли;
	
	ФормаАкта = ПолучитьФорму("Документ.ПоручениеЭкспедитору.ФормаОбъекта");
	ДанныеФормы = ФормаАкта.Объект;
	СоздатьАктНаСервере(ДанныеФормы, ПараметрыДок);
	КопироватьДанныеФормы(ДанныеФормы, ФормаАкта.Объект);
	ФормаАкта.Открыть();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьАктНаСервере(ДанныеФормы, ПараметрыДок)

	оАкт = Документы.ПоручениеЭкспедитору.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(оАкт, ПараметрыДок);
	оАкт.РСК_АктВыдачиТСР 	= Истина;
	оАкт.СпособДоставки		= Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада;
	оАкт.Дата				= ТекущаяДата();
	Если ПустаяСтрока(оАкт.Номер) Тогда
		оАкт.УстановитьНовыйНомер();
	КонецЕсли;
	оАкт.ОсобыеУсловияПеревозкиОписание = ".";	
	оАкт.АдресДоставки = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		оАкт.Пункт,
		Справочники.ВидыКонтактнойИнформации.АдресПартнера,
		ТекущаяДата(),
		Истина
	);
	оАкт.РСК_СтатусАктаВыдачиТСР = Перечисления.РСК_СтатусыАктовВыдачи.Создан;
	ЗначениеВДанныеФормы(оАкт, ДанныеФормы);

КонецПроцедуры // СоздатьАктНаСервере()

&НаКлиенте
Процедура ОткрытьАкт(Команда)
	ТекДанные = Элементы.СписокДокументов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Выберите документ!");
		Возврат;
	КонецЕсли;
	ПоказатьЗначение(, ТекДанные.Акт);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьАкт(Команда)
	ТекДанные = Элементы.СписокДокументов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Выберите документ!");
		Возврат;
	КонецЕсли;
	Текст = "";
	Подсказка = "Укажите причину!";
	ПоказатьВводСтроки(
		Новый ОписаниеОповещения(
			"УдалитьАктЗавершение", 
			ЭтотОбъект, 
			Новый Структура("Док", ТекДанные.Акт)
		), 
		Текст, 
		Подсказка, 
		0, 
		Истина
	);	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьАктЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	Если Строка = Неопределено ИЛИ ПустаяСтрока(Строка) Тогда
		ПоказатьПредупреждение(, "Необходимо ввести причину!!!");
		Возврат;
	КонецЕсли;
	
	ПометитьНаСервере(ДополнительныеПараметры.Док, Строка, "Удалить");

КонецПроцедуры

&НаКлиенте
Процедура ПечатьАкта(Команда)
	
	МассивАктов = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.СписокДокументов.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.СписокДокументов.ДанныеСтроки(ВыделеннаяСтрока);
		МассивАктов.Добавить(ДанныеСтроки.Акт);
	КонецЦикла;
	
	РСК_Клиент.ПечатьАктов(МассивАктов);
	
КонецПроцедуры
